// Lab_03_1.cpp
// Боднар Роман
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 0.2
#include <iostream>
#include <cmath>

using namespace std; 
int main() {
    double x;  // вхідний параметр
    double y1; // результат обчислення (спосіб 1)
    double y2; // результат обчислення (спосіб 2)
    double A;  // проміжний результат - функціонально стала частина виразу
    double B1; // проміжний результат - змінна частина (спосіб 1)
    double B2; // проміжний результат - змінна частина (спосіб 2)

    cout << "x = ";
    cin >> x; 

    // Обчислюємо сталу частину виразу
    A = 1.0 / x + 4.0;

    // Спосіб 1: скорочена форма (послідовні if) 
    if (x < 1) {
        B1 = 0.65 * x + 8.0;
    }
    if (x >= 1 && x < 5) {
        B1 = atan((x + 6.1) / 2.0) + exp(x);
    }
    if (x >= 5) {
        B1 = sqrt(1.0 + sqrt(x));
    }
    y1 = A - B1;

    //Спосіб 2: повна форма (if - else if - else) 
    if (x < 1) {
        B2 = 0.65 * x + 8.0;
    }
    else if (x < 5) {
        B2 = atan((x + 6.1) / 2.0) + exp(x);
    }
    else {
        B2 = sqrt(1.0 + sqrt(x));
    }
    y2 = A - B2;

    // Виведення результатів
    cout << endl;
    cout << "1) y = " << y1 << endl;
    cout << "2) y = " << y2 << endl;

    return 0;

}